Tekla Open API Reference for Tekla Structures 2025
LoftedPlate.Modify Method
 Modifies the lofted plate object values in the database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True if success
Exceptions
Exception | Condition
LoftedPlateOperationException |  Thrown if the input base curves would yield an invalid lofted plate. The most derived type of the exception can be used to retrieve the actual source of error.
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace